Revit 2027 API
ParameterTypeId.RebarHookStyle Property
 "Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarHookStyle { get; }
Public Shared ReadOnly Property RebarHookStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookStyle {
	ForgeTypeId^ get ();
}
static member RebarHookStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace